Tekla.Structures.Analysis.AnalysisLocalCoordinateSystem
The AnalysisLocalCoordinateSystem class contains local coordinate system
information for an analysis model.

Tekla.Structures.Analysis.AnalysisLocalCoordinateSystem._LocalX
The local X direction.

Tekla.Structures.Analysis.AnalysisLocalCoordinateSystem._LocalY
The local Y direction.

Tekla.Structures.Analysis.AnalysisLocalCoordinateSystem.#ctor
Creates a new analysis local coordinate system instance.

Tekla.Structures.Analysis.AnalysisLocalCoordinateSystem.LocalX
The local X direction.

Tekla.Structures.Analysis.AnalysisLocalCoordinateSystem.LocalY
The local Y direction.